#-----------------------------------------
# Taps
#-----------------------------------------
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'font-hack-nerd-font'
tap 'jesseduffield/lazygit/lazygit'

#-----------------------------------------
# Dev Tools
#-----------------------------------------
brew 'yadm'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'diff-so-fancy'
brew 'git-extras'
brew 'vim'
brew 'wget'
brew 'zellij'
brew 'ripgrep'
brew 'lazygit'
brew 'fzf'
brew 'fd'

brew 'coreutils'
brew 'asdf'

#-----------------------------------------
# Casks
#-----------------------------------------
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'visual-studio-code'
cask 'cursor'
cask 'ghostty'
cask 'obsidian'
cask 'karabiner-elements'
cask 'font-hack-nerd-font'

#-----------------------------------------
# Docker
#-----------------------------------------
cask 'docker'
